tests/functional/routes/cassettes/TestAccount.test_striped_user_can_modify_plan.yaml

interactions:
- request:
    body: email=user%40holepunch.io&description=HP+TEST+2019-07-11+22%3A55%3A45.644501+None
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '81'
      Content-Type:
      - application/x-www-form-urlencoded
      Idempotency-Key:
      - f81340ed-7e45-4a90-9971-716a6eace352
      User-Agent:
      - Stripe/v1 PythonBindings/2.31.0
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_VLWY1noaoN6plX", "request_duration_ms":
        180}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.31.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.7.3", "platform": "Linux-4.9.125-linuxkit-x86_64-with-debian-9.9",
        "uname": "Linux 93c5a5bfa3ca 4.9.125-linuxkit #1 SMP Fri Sep 7 08:20:28 UTC
        2018 x86_64 "}'
      authorization:
      - NOKEYFORYOU
    method: POST
    uri: https://api.stripe.com/v1/customers
  response:
    body:
      string: "{\n  \"id\": \"cus_FQ1D0qsysFiM95\",\n  \"object\": \"customer\",\n
        \ \"account_balance\": 0,\n  \"address\": null,\n  \"balance\": 0,\n  \"created\":
        1562885745,\n  \"currency\": null,\n  \"default_source\": null,\n  \"delinquent\":
        false,\n  \"description\": \"HP TEST 2019-07-11 22:55:45.644501 None\",\n
        \ \"discount\": null,\n  \"email\": \"user@holepunch.io\",\n  \"invoice_prefix\":
        \"F6BC4C96\",\n  \"invoice_settings\": {\n    \"custom_fields\": null,\n    \"default_payment_method\":
        null,\n    \"footer\": null\n  },\n  \"livemode\": false,\n  \"metadata\":
        {\n  },\n  \"name\": null,\n  \"phone\": null,\n  \"preferred_locales\": [\n\n
        \ ],\n  \"shipping\": null,\n  \"sources\": {\n    \"object\": \"list\",\n
        \   \"data\": [\n\n    ],\n    \"has_more\": false,\n    \"total_count\":
        0,\n    \"url\": \"/v1/customers/cus_FQ1D0qsysFiM95/sources\"\n  },\n  \"subscriptions\":
        {\n    \"object\": \"list\",\n    \"data\": [\n\n    ],\n    \"has_more\":
        false,\n    \"total_count\": 0,\n    \"url\": \"/v1/customers/cus_FQ1D0qsysFiM95/subscriptions\"\n
        \ },\n  \"tax_exempt\": \"none\",\n  \"tax_ids\": {\n    \"object\": \"list\",\n
        \   \"data\": [\n\n    ],\n    \"has_more\": false,\n    \"total_count\":
        0,\n    \"url\": \"/v1/customers/cus_FQ1D0qsysFiM95/tax_ids\"\n  },\n  \"tax_info\":
        null,\n  \"tax_info_verification\": null\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '1169'
      Content-Type:
      - application/json
      Date:
      - Thu, 11 Jul 2019 22:55:45 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      idempotency-key:
      - f81340ed-7e45-4a90-9971-716a6eace352
      original-request:
      - req_va1iTiMLNly65z
      request-id:
      - req_va1iTiMLNly65z
      stripe-version:
      - '2019-03-14'
    status:
      code: 200
      message: OK
- request:
    body: customer=cus_FQ1D0qsysFiM95
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '27'
      Content-Type:
      - application/x-www-form-urlencoded
      Idempotency-Key:
      - e4d617d8-f15e-484f-ac83-528b1ce306aa
      User-Agent:
      - Stripe/v1 PythonBindings/2.31.0
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_va1iTiMLNly65z", "request_duration_ms":
        252}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.31.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.7.3", "platform": "Linux-4.9.125-linuxkit-x86_64-with-debian-9.9",
        "uname": "Linux 93c5a5bfa3ca 4.9.125-linuxkit #1 SMP Fri Sep 7 08:20:28 UTC
        2018 x86_64 "}'
      authorization:
      - NOKEYFORYOU
    method: POST
    uri: https://api.stripe.com/v1/payment_methods/pm_card_visa/attach
  response:
    body:
      string: "{\n  \"id\": \"pm_1EvBAzFWLfbqapoHP4Q7IrMO\",\n  \"object\": \"payment_method\",\n
        \ \"billing_details\": {\n    \"address\": {\n      \"city\": null,\n      \"country\":
        null,\n      \"line1\": null,\n      \"line2\": null,\n      \"postal_code\":
        null,\n      \"state\": null\n    },\n    \"email\": null,\n    \"name\":
        null,\n    \"phone\": null\n  },\n  \"card\": {\n    \"brand\": \"visa\",\n
        \   \"checks\": {\n      \"address_line1_check\": null,\n      \"address_postal_code_check\":
        null,\n      \"cvc_check\": null\n    },\n    \"country\": \"US\",\n    \"exp_month\":
        7,\n    \"exp_year\": 2020,\n    \"fingerprint\": \"5WF0F0bdzuufzLej\",\n
        \   \"funding\": \"credit\",\n    \"generated_from\": null,\n    \"last4\":
        \"4242\",\n    \"three_d_secure_usage\": {\n      \"supported\": true\n    },\n
        \   \"wallet\": null\n  },\n  \"created\": 1562885746,\n  \"customer\": \"cus_FQ1D0qsysFiM95\",\n
        \ \"livemode\": false,\n  \"metadata\": {\n  },\n  \"type\": \"card\"\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '849'
      Content-Type:
      - application/json
      Date:
      - Thu, 11 Jul 2019 22:55:46 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      idempotency-key:
      - e4d617d8-f15e-484f-ac83-528b1ce306aa
      original-request:
      - req_NJ4UrEdzuwrHR2
      request-id:
      - req_NJ4UrEdzuwrHR2
      stripe-version:
      - '2019-03-14'
    status:
      code: 200
      message: OK
version: 1
